In [2]:
import numpy as np
import pandas as pd

In [3]:
sozluk1 = {"Isim":["Ahmet","Mehmet","Zeynep","Atil"],"Spor":["Kosu","Yuzme","Kosu","Basketbol"],
          "Kalori": [100,200,300,400]}

In [4]:
dataFrame1 = pd.DataFrame(sozluk1,index=[0,1,2,3])

In [5]:
dataFrame1

     Isim       Spor  Kalori
0   Ahmet       Kosu     100
1  Mehmet      Yuzme     200
2  Zeynep       Kosu     300
3    Atil  Basketbol     400

In [6]:
sozluk2 = {"Isim":["Osman","Levent","Atlas","Fatma"],"Spor":["Kosu","Yuzme","Kosu","Basketbol"],
          "Kalori": [500,400,300,200]}

In [7]:
dataFrame2 = pd.DataFrame(sozluk2,index=[4,5,6,7])

In [8]:
sozluk3 = {"Isim":["Ayse","Mahmud","Duygu","Nur"],"Spor":["Kosu","Kosmayısı","Kosu","Basketbol"],
          "Kalori": [600,700,800,900]}

In [9]:
dataFrame3 = pd.DataFrame(sozluk3,index=[8,9,10,11])

In [10]:
dataFrame1

     Isim       Spor  Kalori
0   Ahmet       Kosu     100
1  Mehmet      Yuzme     200
2  Zeynep       Kosu     300
3    Atil  Basketbol     400

In [11]:
dataFrame2

     Isim       Spor  Kalori
4   Osman       Kosu     500
5  Levent      Yuzme     400
6   Atlas       Kosu     300
7   Fatma  Basketbol     200

In [12]:
dataFrame3

      Isim       Spor  Kalori
8     Ayse       Kosu     600
9   Mahmud  Kosmayısı     700
10   Duygu       Kosu     800
11     Nur  Basketbol     900

## concatenation == birleştirme

In [13]:
pd.concat([dataFrame1,dataFrame2,dataFrame3])

      Isim       Spor  Kalori
0    Ahmet       Kosu     100
1   Mehmet      Yuzme     200
2   Zeynep       Kosu     300
3     Atil  Basketbol     400
4    Osman       Kosu     500
5   Levent      Yuzme     400
6    Atlas       Kosu     300
7    Fatma  Basketbol     200
8     Ayse       Kosu     600
9   Mahmud  Kosmayısı     700
10   Duygu       Kosu     800
11     Nur  Basketbol     900

In [14]:
pd.concat([dataFrame1,dataFrame2,dataFrame3],axis = 1)

,Isim,Spor,Kalori,Isim,Spor,Kalori,Isim,Spor,Kalori
0,Ahmet,Kosu,100.0,NaN,NaN,NaN,NaN,NaN,NaN
1,Mehmet,Yuzme,200.0,NaN,NaN,NaN,NaN,NaN,NaN
2,Zeynep,Kosu,300.0,NaN,NaN,NaN,NaN,NaN,NaN
3,Atil,Basketbol,400.0,NaN,NaN,NaN,NaN,NaN,NaN
4,NaN,NaN,NaN,Osman,Kosu,500.0,NaN,NaN,NaN
5,NaN,NaN,NaN,Levent,Yuzme,400.0,NaN,NaN,NaN
6,NaN,NaN,NaN,Atlas,Kosu,300.0,NaN,NaN,NaN
7,NaN,NaN,NaN,Fatma,Basketbol,200.0,NaN,NaN,NaN
8,NaN,NaN,NaN,NaN,NaN,NaN,Ayse,Kosu,600.0
9,NaN,NaN,NaN,NaN,NaN,NaN,Mahmud,Kosmayısı,700.0
10,NaN,NaN,NaN,NaN,NaN,NaN,Duygu,Kosu,800.0
11,NaN,NaN,NaN,NaN,NaN,NaN,Nur,Basketbol,900.0

## merge or merging birleştirme kaynaştırma

In [24]:
mergeSozluk1 = {"Isim":["Ahmet","Mehmet","Zeynep","Atil"],
                "Spor": ["Kosu","Yuzme","Kosu","Basketbol"]}

In [25]:
mergeDataFrame1 = pd.DataFrame(mergeSozluk1)

In [26]:
mergeDataFrame1

     Isim       Spor
0   Ahmet       Kosu
1  Mehmet      Yuzme
2  Zeynep       Kosu
3    Atil  Basketbol

In [30]:
mergeSozluk2 = {"Isim":["Ahmet","Mehmet","Zeynep","Atil"],
                "Kalori": [10,200,150,250]}

In [32]:
mergeDataFrame2 = pd.DataFrame(mergeSozluk2)

In [33]:
mergeDataFrame2

     Isim  Kalori
0   Ahmet      10
1  Mehmet     200
2  Zeynep     150
3    Atil     250

In [34]:
pd.merge(mergeDataFrame1,mergeDataFrame2, on = "Isim")   # on ortak olan kısım

     Isim       Spor  Kalori
0   Ahmet       Kosu      10
1  Mehmet      Yuzme     200
2  Zeynep       Kosu     150
3    Atil  Basketbol     250

In [36]:
maasSozluk = {"Isim" : ["Atil","Zeynep","Mehmet","Ahmet"],
              "Departman": ["Yazılım","Satıs","Pazarlama","Yazılım"],
             "Maas": [200,300,400,500]}

In [37]:
maasDataFrame = pd.DataFrame(maasSozluk)

In [38]:
maasDataFrame

     Isim  Departman  Maas
0    Atil    Yazılım   200
1  Zeynep      Satıs   300
2  Mehmet  Pazarlama   400
3   Ahmet    Yazılım   500

In [40]:
maasDataFrame["Departman"].unique() ## eşsiz olanları getir

array(['Yazılım', 'Satıs', 'Pazarlama'], dtype=object)

In [41]:
maasDataFrame["Departman"].nunique()  ## eşssizlerin sayısı

3

In [42]:
maasDataFrame["Departman"].value_counts()

Yazılım      2
Satıs        1
Pazarlama    1
Name: Departman, dtype: int64

In [45]:
def bruttenNete(maas):
    return maas*0.66

In [46]:
maasDataFrame["Maas"].apply(bruttenNete)

0    132.0
1    198.0
2    264.0
3    330.0
Name: Maas, dtype: float64

In [47]:
maasDataFrame.isnull() ## null değer var mı kontrol daha büyük diziler için

    Isim  Departman   Maas
0  False      False  False
1  False      False  False
2  False      False  False
3  False      False  False

In [57]:
yeniBirVeri = {"Karakter Sinif" : ["South Park","South Park","Simpson","Simpson","Simpson"],
              "Karakter Isim": ["Cartman","Kenny","Homer","Bart","Bart"],
              "Karakter Yas": [9,10,50,20,10]}

In [58]:
karakterDF = pd.DataFrame(yeniBirVeri)

In [59]:
karakterDF

  Karakter Sinif Karakter Isim  Karakter Yas
0     South Park       Cartman             9
1     South Park         Kenny            10
2        Simpson         Homer            50
3        Simpson          Bart            20
4        Simpson          Bart            10

In [60]:
karakterDF.pivot_table(values = "Karakter Yas", index = ["Karakter Sinif","Karakter Isim"])  ## bartın değerlerin ort aldı

                              Karakter Yas
Karakter Sinif Karakter Isim
Simpson        Bart                     15
               Homer                    50
South Park     Cartman                   9
               Kenny                    10

In [62]:
karakterDF.pivot_table(values = "Karakter Yas", index = ["Karakter Sinif","Karakter Isim"],aggfunc=np.sum) ## ortak olanları topladı

                              Karakter Yas
Karakter Sinif Karakter Isim
Simpson        Bart                     30
               Homer                    50
South Park     Cartman                   9
               Kenny                    10